###############################################################################################################################################################
#####        █████╗ ██╗      ██████╗  ██████╗ ██╗  ██╗██╗██╗   ██╗███████╗     ██╗  ██╗     ██████╗ ██╗      █████╗ ███╗   ██╗██╗  ██╗                    #####
#####       ██╔══██╗██║     ██╔════╝ ██╔═══██╗██║  ██║██║██║   ██║██╔════╝     ╚██╗██╔╝     ██╔══██╗██║     ██╔══██╗████╗  ██║██║ ██╔╝                    #####
#####       ███████║██║     ██║  ███╗██║   ██║███████║██║██║   ██║█████╗        ╚███╔╝      ██████╔╝██║     ███████║██╔██╗ ██║█████╔╝                     #####
#####       ██╔══██║██║     ██║   ██║██║   ██║██╔══██║██║╚██╗ ██╔╝██╔══╝        ██╔██╗      ██╔═══╝ ██║     ██╔══██║██║╚██╗██║██╔═██╗                     #####
#####       ██║  ██║███████╗╚██████╔╝╚██████╔╝██║  ██║██║ ╚████╔╝ ███████╗     ██╔╝ ██╗     ██║     ███████╗██║  ██║██║ ╚████║██║  ██╗                    #####
#####       ╚═╝  ╚═╝╚══════╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═══╝  ╚══════╝     ╚═╝  ╚═╝     ╚═╝     ╚══════╝╚═╝  ╚═╝╚═╝  ╚═══╝╚═╝  ╚═╝                    #####
###############################################################################################################################################################
# Authors: Tristan Truckle & PLANK Team
# Version: 1.0
# Date: 15-01-2026
# Subject: Terraform AWS Infrastructure Deployment Project for AlgoHive x Plank
# Description:
# Notes :
###############################################################################################################################################################

output "argocd_capability_arn" {
  description = "ARN of the EKS managed Argo CD capability"
  value       = try(aws_eks_capability.argocd[0].arn, null)
}

output "argocd_capability_version" {
  description = "Version of the EKS managed Argo CD capability"
  value       = try(aws_eks_capability.argocd[0].version, null)
}

output "argocd_server_url" {
  description = "Managed Argo CD server URL"
  value       = try(aws_eks_capability.argocd[0].configuration[0].argo_cd[0].server_url, null)
}

output "argocd_idc_managed_application_arn" {
  description = "Identity Center managed application ARN used by Argo CD"
  value       = try(aws_eks_capability.argocd[0].configuration[0].argo_cd[0].aws_idc[0].idc_managed_application_arn, null)
}

output "argocd_capability_role_arn" {
  description = "IAM role ARN used by EKS managed Argo CD capability"
  value       = try(aws_iam_role.argocd_capability[0].arn, null)
}
