###############################################################################################################################################################
#####        █████╗ ██╗      ██████╗  ██████╗ ██╗  ██╗██╗██╗   ██╗███████╗     ██╗  ██╗     ██████╗ ██╗      █████╗ ███╗   ██╗██╗  ██╗                    #####
#####       ██╔══██╗██║     ██╔════╝ ██╔═══██╗██║  ██║██║██║   ██║██╔════╝     ╚██╗██╔╝     ██╔══██╗██║     ██╔══██╗████╗  ██║██║ ██╔╝                    #####
#####       ███████║██║     ██║  ███╗██║   ██║███████║██║██║   ██║█████╗        ╚███╔╝      ██████╔╝██║     ███████║██╔██╗ ██║█████╔╝                     #####
#####       ██╔══██║██║     ██║   ██║██║   ██║██╔══██║██║╚██╗ ██╔╝██╔══╝        ██╔██╗      ██╔═══╝ ██║     ██╔══██║██║╚██╗██║██╔═██╗                     #####
#####       ██║  ██║███████╗╚██████╔╝╚██████╔╝██║  ██║██║ ╚████╔╝ ███████╗     ██╔╝ ██╗     ██║     ███████╗██║  ██║██║ ╚████║██║  ██╗                    #####
#####       ╚═╝  ╚═╝╚══════╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═══╝  ╚══════╝     ╚═╝  ╚═╝     ╚═╝     ╚══════╝╚═╝  ╚═╝╚═╝  ╚═══╝╚═╝  ╚═╝                    #####
###############################################################################################################################################################
# Authors: Tristan Truckle & PLANK Team
# Version: 1.0
# Date: 15-01-2026
# Subject: Terraform AWS Infrastructure Deployment Project for AlgoHive x Plank
# Description:
# Notes :
###############################################################################################################################################################

variable "cluster_name" {
  description = "EKS cluster name"
  type        = string
}

variable "aws_region" {
  description = "AWS region"
  type        = string
}

variable "dashboard_name" {
  description = "CloudWatch dashboard name"
  type        = string
}

variable "api_error_alarm_threshold" {
  description = "Threshold for API error alarm"
  type        = number
  default     = 1
}

variable "failed_node_alarm_threshold" {
  description = "Threshold for failed node count alarm"
  type        = number
  default     = 0
}

variable "node_cpu_alarm_threshold" {
  description = "Threshold for node CPU utilization alarm (%)"
  type        = number
  default     = 85
}

variable "node_memory_alarm_threshold" {
  description = "Threshold for node memory utilization alarm (%)"
  type        = number
  default     = 85
}

variable "pending_pods_alarm_threshold" {
  description = "Threshold for pending pods alarm"
  type        = number
  default     = 10
}

variable "pod_restarts_alarm_threshold" {
  description = "Threshold for pod restart count alarm per period"
  type        = number
  default     = 20
}

variable "alarm_actions" {
  description = "Alarm action ARNs (SNS etc.)"
  type        = list(string)
  default     = []
}

variable "ok_actions" {
  description = "OK action ARNs (SNS etc.)"
  type        = list(string)
  default     = []
}
